opendj-sdk/opends/tests/staf-tests/functional-tests/shared/data/dsml/suites/07srchsuite/data/srch165.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 700
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
        <searchRequest dn="ou=Americas, ou=Search, o=IMC, c=US" scope="wholeSubtree" derefAliases="neverDerefAliases">
        <filter>
		<equalityMatch name="cn">
			<value>Clint Eastwood</value>
		</equalityMatch>
        </filter>
	<attributes>
		<attribute name="1.1"/>	
	</attributes>
        </searchRequest>
      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>
